{
  "_position_embedding_type": "absolute",
  "architectures": [
    "LayoutLMForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-FIELD",
    "2": "I-FIELD",
    "3": "B-NUM",
    "4": "I-NUM",
    "5": "B-HEADER",
    "6": "I-HEADER"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-FIELD": 1,
    "B-HEADER": 5,
    "B-NUM": 3,
    "I-FIELD": 2,
    "I-HEADER": 6,
    "I-NUM": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_2d_position_embeddings": 1024,
  "max_position_embeddings": 512,
  "model_type": "layoutlm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.55.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
